<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"96d8ef73d98ffb6b6bfbc6ea6f1f881baa453be1bdb7e242b0792962b0790928","plan_job_ref":"Job PR Plan #28 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11813052427","plan_out_hash":"c7dc70d03aa72a90f1e96537fb04b9c6c4cd57a731a3ec59d71dce209df3da5b","plan_hash":"378c84be5aac5047f6eeea950a4423130e0851190d6a74ace541254ebbd51a27","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

  # local_file.test will be created
+   resource "local_file" "test" {
+       content              = "test"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./test.txt"
+       id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #8](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11813069156)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>